src/InformationRegisters/SabatexExchangeNodeConfig.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>SabatexExchangeNodeConfig</Name>
			<Comment>Configuration for exchange</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>destinationId</Name>
					<Comment>Вузел призначення обміну</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>isActive</Name>
					<Comment>Признак активності даного вузла (так - обмін проводити / ні - обмін призупинити) </Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Take</Name>
					<Comment>Кількість повідомлень за один сеанс обміну</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>LogLevel</Name>
					<Comment>Див регістр sabatexExchangeLog (0..9)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>updateCatalogs</Name>
					<Comment>Оновлювати довідники (Перезаповнення полів довідників)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>userDefinedModule</Name>
					<Comment>модуль в якому  будуть оброблятись вхідні обєкти</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IsQueryEnable</Name>
					<Comment>Підтримка запитів від даного нода до цієї бази</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ExchangeMode</Name>
					<Type>
						<v8:Type>cfg:EnumRef.SabatexExchangeMode</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Send</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Parse</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>TakeOneMessageAtATime</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>UpdateTransacted</Name>
					<Comment>Заборона повторного імпорту проведених документів прт різниці в  годинах (0-заборонено,1.2...)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>NodeName</Name>
					<Comment>Назва віддаленого вузла</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/SabatexExchangeNodeType.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>SabatexExchangeNodeType</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Sabatex</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>USAP</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/InformationRegisters/SabatexExchangeNodeConfig/Forms/RecordForm/Ext/Form/Module.bsl
&AtServer
Procedure UpdateVisibility()
	if Record.NodeType = Enums.SabatexExchangeNodeType.USAP then
		Items.USAPLoginGroup.Visible = true;
		Items.destinationId.Visible = false;
	else
		Items.USAPLoginGroup.Visible = false;
		Items.destinationId.Visible = true;
	endif;
   
EndProcedure



&AtServer
Procedure OnReadAtServer(CurrentObject)
	if CurrentObject.NodeType = Enums.SabatexExchangeNodeType.USAP then
		hostConf = SabatexExchange.GetHostConfig(Enums.SabatexExchangeNodeType.USAP,CurrentObject.NodeName);
		host = hostConf.host;
		login = hostConf.login;
		password = hostConf.password;
		cid = hostConf.cid;
	endif;	
EndProcedure

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	Title = Record.NodeName;
	UpdateVisibility();
	if Record.NodeType = Enums.SabatexExchangeNodeType.EmptyRef() then
		Record.NodeType = Enums.SabatexExchangeNodeType.Sabatex;
	endif;
EndProcedure

&AtClient
Procedure NodeNameOnChange(Item)
EndProcedure

&AtClient
Procedure NodeTypeOnChange(Item)
	UpdateVisibility();
EndProcedure

&AtServer
Procedure OnWriteAtServer(Cancel, CurrentObject, WriteParameters)
	if CurrentObject.NodeType = Enums.SabatexExchangeNodeType.USAP then
		result = new structure;
		result.Insert("cid",SabatexExchange.ValueOrDefault(cid,true));
		result.Insert("Host",SabatexExchange.ValueOrDefault(Host,""));
		result.Insert("login",SabatexExchange.ValueOrDefault(login,""));
		result.Insert("password",SabatexExchange.ValueOrDefault(password,""));
		SabatexExchange.SetHostConfig(result,CurrentObject.NodeType,Record.NodeName);
	endif;	
EndProcedure
